<script lang="ts" setup>
const modalRef = ref<HTMLDialogElement | null>(null)

defineExpose({ open })

function open() {
  modalRef.value?.showModal()
}
</script>

<template>
  <dialog class="modal" ref="modalRef">
    <div class="modal-box" tabindex="0">
      <button class="btn btn-sm btn-circle btn-ghost absolute right-2 top-2" @click="modalRef?.close()">✕</button>
      <p class="mt-5">ДОГОВОР-ОФЕРТА НА ОКАЗАНИЕ ЛОГИСТИЧЕСКИХ УСЛУГ</p>
      <br />
      <ol class="list-decimal pl-5">
        <li>
          <b>Общие положения</b>
          <ul class="list-disc pl-5">
            <li>
              Настоящий Договор-оферта (далее – «Договор») является официальным предложением компании
              <b>Beezon Logistics</b>
              (далее – «Компания») и определяет условия оказания логистических услуг клиентам сервиса
              <b>Beezon Logistics</b>
              (далее – «Клиент»).
            </li>
            <li>
              Принятие условий настоящего Договора (акцепт) осуществляется путем регистрации в приложении
              <b>Beezon Online</b>
              (https://t.me/beezon_orders_bot), оформления заказа через форму приема заказов
              (https://beezon.online/neworder) или фактического использования услуг Компании.
            </li>
            <li>Настоящий договор регулируется законодательством Грузии.</li>
          </ul>
        </li>
        <li>
          <b>Услуги и условия их оказания</b>
          <ul class="list-disc pl-5">
            <li>
              Компания оказывает логистические услуги, в том числе:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>Прием груза в пунктах выдачи в г. Владикавказ, Республика Северная Осетия, Россия</li>
                <li>
                  Хранение и перевозку грузов <b>разрешенных категорий</b> из России в Грузию, из Грузии в Россию, а
                  также из Грузии в Европу и Сербию между пунктами выдачи Компании.
                </li>
                <li>Передача груза компании-посреднику Pony Express/Delivo для доставки внутри Грузии;</li>
                <li>Передача груза компании-посреднику CDEK для доставки внутри России;</li>
                <li>Оформление и сопровождение грузов, включая таможенное декларирование;</li>
                <li>Дополнительные сервисы, такие как упаковка, маркировка и страхование грузов.</li>
              </ul>
            </li>
            <li>
              Клиент обязуется предоставлять достоверную информацию о грузе, его содержимом и контактных данных
              получателя.
            </li>
            <li>
              Компания не несет ответственности за содержимое отправлений, если Клиент предоставил недостоверные
              сведения.
            </li>
          </ul>
        </li>
        <li>
          <b>Стоимость и порядок оплаты </b>
          <ul class="list-disc pl-5">
            <li>
              Стоимость услуг определяется тарифами Компании, опубликованными в информационном канале Компании
              (https://t.me/beezon_logistics/145).
            </li>
            <li>
              Оплата услуг производится безналичным расчетом через доступные платежные системы либо наличными в пунктах
              приема.
            </li>
          </ul>
        </li>
        <li>
          <b>Ответственность сторон</b>
          <ul class="list-disc pl-5">
            <li>
              Компания несет ответственность за сохранность груза с момента его принятия до момента передачи получателю.
            </li>
            <li>
              Компания освобождается от ответственности в случаях:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>
                  Задержки доставки груза по независящим от Компании обстоятельствам (погодные условия, действия третьих
                  лиц и пр.);
                </li>
                <li>
                  Нарушения Клиентом правил перевозки, в том числе заказа запрещенных к провозу товаров, которые были
                  изъяты на границе;
                </li>
                <li>Повреждения груза до момента его получения Компанией;</li>
                <li>Неправильного оформления заказа в пункты выдачи без уведомления об этом менеджера Компании.</li>
              </ul>
            </li>
          </ul>
        </li>
        <li>
          <b>Запрещенные к заказу и перевозке товары </b>
          <ul class="list-disc pl-5">
            <li>Табак, вейп, жидкости для вейпа;</li>
            <li>Ювелирные изделия, антиквариат;</li>
            <li>Легковоспламеняющиеся вещества (зажигалки и т.п.);</li>
            <li>Оружие, боеприпасы и взрывчатые вещества;</li>
            <li>Наркотики и наркосодержащие препараты;</li>
            <li>Дроны и беспилотные летательные аппараты.</li>
          </ul>
          <p>
            Клиент несет полную ответственность за заказ запрещенных к перевозке товаров. В случае выявления таковых при
            прохождении таможенного контроля, Компания предоставляет таможенным органам контактные данные получателя для
            дальнейших разбирательств.
          </p>
        </li>
        <li>
          <b>Конфиденциальность и обработка персональных данных</b>
          <ul class="list-disc pl-5">
            <li>
              Клиент дает согласие на обработку персональных данных в соответствии с Политикой конфиденциальности
              Компании.
            </li>
            <li>
              Данные Клиента хранятся бессрочно, если Клиент не запросит их удаление, направив запрос на
              <a class="text-blue-700 font-semibold" href="mailto:beezon.georgia@gmail.com">beezon.georgia@gmail.com</a>
              или через Telegram
              <a class="text-blue-700 font-semibold" href="https://t.me/Beezon_manager_ge">@beezon_manager_ge</a>.
            </li>
          </ul>
        </li>
        <li>
          <b>Разрешение споров</b>
          <ul class="list-disc pl-5">
            <li>Все споры и разногласия решаются путем переговоров.</li>
          </ul>
        </li>
        <li>
          <b>Контактные данные Компании и реквизиты:</b>
          <ul class="list-disc pl-5">
            <li>Individual entrepreneur Anna Zelezniakova</li>
            <li>Bank account: GE31TB7788236010100040</li>
            <li>
              E-mail:
              <a class="text-blue-700 font-semibold" href="mailto:beezon.georgia@gmail.com">beezon.georgia@gmail.com</a>
            </li>
            <li>
              Telegram
              <a class="text-blue-700 font-semibold" href="https://t.me/Beezon_manager_ge">@beezon_manager_ge</a>
            </li>
          </ul>
        </li>
      </ol>
      <p class="mt-5">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</p>
      <br />
      <ol class="list-decimal pl-5">
        <li>
          <b>Общие положения</b>
          <ul class="list-disc pl-5">
            <li>
              Настоящая Политика конфиденциальности (далее — "Политика") определяет порядок обработки и защиты
              персональных данных клиентов сервиса Beezon Logistics (далее — "Клиент").
            </li>
            <li>
              Компания Beezon Logistics (далее — "Компания") осуществляет обработку персональных данных в соответствии с
              действующим законодательством Грузии и международными стандартами защиты информации.
            </li>
            <li>Использование Клиентом сервиса Beezon Logistics означает согласие с настоящей Политикой.</li>
          </ul>
        </li>
        <li>
          <b>Персональные данные и их сбор</b>
          <ul class="list-disc pl-5">
            <li>
              Компания собирает и обрабатывает следующие персональные данные Клиента:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>Фамилия, имя;</li>
                <li>
                  Контактные данные (номер телефона, e-mail, адрес доставки, имя пользователя Telegram, Telegram ID,
                  опись заказа);
                </li>
                <li>Данные, необходимые для таможенного оформления (если применимо);</li>
                <li>Информацию о заказах и платежах;</li>
                <li>Иные данные, необходимые для предоставления логистических услуг.</li>
              </ul>
            </li>
            <li>
              Источники сбора персональных данных:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>
                  Данные, предоставленные Клиентом при регистрации в сервисе Beezon Online
                  (https://t.me/beezon_orders_bot);
                </li>
                <li>
                  Данные, введенные при оформлении заказа через форму приема заказов (https://beezon.online/neworder);
                </li>
                <li>Данные, переданные Клиентом в процессе взаимодействия с менеджерами Компании.</li>
              </ul>
            </li>
            <li>
              Компания использует персональные данные исключительно в следующих целях:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>Оказание логистических услуг;</li>
                <li>Обработка заказов и информирование Клиентов о статусе доставки;</li>
                <li>Выполнение требований таможенного законодательства (при необходимости);</li>
                <li>Улучшение качества работы сервиса и персонализация услуг;</li>
                <li>Выполнение обязательств перед Клиентом.</li>
              </ul>
            </li>
          </ul>
        </li>
        <li>
          <b>Передача и хранение персональных данных</b>
          <ul class="list-disc pl-5">
            <li>
              Компания обязуется не передавать персональные данные третьим лицам, за исключением следующих случаев:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>По запросу уполномоченных государственных органов в рамках законодательства;</li>
                <li>Таможенным органам при выявлении запрещённых к перевозке товаров;</li>
                <li>
                  Партнёрским курьерским и логистическим службам (Pony Express, Delivo, CDEK) для выполнения доставки.
                </li>
              </ul>
            </li>
            <li>Данные Клиента хранятся бессрочно, если Клиент не запросит их удаление.</li>
            <li>
              Клиент может запросить удаление персональных данных, направив соответствующее обращение на электронную
              почту
              <a class="text-blue-700 font-semibold" href="mailto:beezon.georgia@gmail.com">beezon.georgia@gmail.com</a>
              или через Telegram
              <a class="text-blue-700 font-semibold" href="https://t.me/Beezon_manager_ge">@beezon_manager_ge</a>.
            </li>
          </ul>
        </li>
        <li>
          <b>Защита персональных данных</b>
          <ul class="list-disc pl-5">
            <li>
              Компания принимает все необходимые организационные и технические меры для защиты персональных данных от
              утраты, несанкционированного доступа, изменения и распространения.
            </li>
            <li>
              Доступ к персональным данным имеют только уполномоченные сотрудники Компании, обязанные соблюдать
              конфиденциальность.
            </li>
          </ul>
        </li>
        <li>
          <b>Права Клиента</b>
          <ul class="list-disc pl-5">
            <li>
              Клиент имеет право:
              <ul class="list-['○'] pl-5 inner-disc-list">
                <li>Получать информацию о своих персональных данных и целях их обработки;</li>
                <li>Требовать исправления, обновления или удаления данных;</li>
                <li>Отозвать согласие на обработку персональных данных;</li>
              </ul>
            </li>
          </ul>
        </li>
        <li>
          <b>Изменения в Политике конфиденциальности</b>
          <ul class="list-disc pl-5">
            <li>
              Компания оставляет за собой право изменять Политику в любое время. Актуальная версия Политики публикуется
              в официальных источниках Компании.
            </li>
            <li>
              Продолжение использования сервиса Клиентом после внесения изменений означает согласие с новой редакцией
              Политики.
            </li>
          </ul>
        </li>
        <li>
          <b>Контактные данные</b>
          <ul class="list-disc pl-5">
            <li>
              E-mail:
              <a class="text-blue-700 font-semibold" href="mailto:beezon.georgia@gmail.com">beezon.georgia@gmail.com</a>
            </li>
            <li>
              Телеграм:
              <a class="text-blue-700 font-semibold" href="https://t.me/Beezon_manager_ge">@beezon_manager_ge</a>
            </li>
          </ul>
        </li>
      </ol>
      <div class="modal-action">
        <button class="btn btn-block rounded-xl" @click="modalRef?.close()">Закрыть</button>
      </div>
    </div>
  </dialog>
</template>

<style>
.inner-disc-list li {
  padding-left: 5px;
}
</style>
